#include <stdio.h>
int main()
{
    int (*p)[10];
    int a[10]={31,28,31,30,31,30,31,31,30,31};
    p=&a;
    for(int i=0;i<10;i++)
    {
        printf("%d ",*p[i]);
    }
    putchar('\n');
    /*
    p和*先繎在一块，说明p是指针。网上查了下这个是指向整数数组的指针。
    如果省略上面的圆括号，就是有10个指针的数组。

    const int* (p[10]);
    是十个指针，指针的地址能变，但是指向的值不能变。
    那我不确定，值不能变的话，这10个指针不管指向哪里，值都必须是同一个吗？
    还是只是初始化时那个地址的值是不可变的？

    int (*f1(int))(int*, int);
    f1是函数，有一个int的形参，返回指向整型的指针。再看不出来了，还是说把(*f1(int))看成一个整体作为函数名，
    然后两个形参，一个指针一个整数？
    */
}